{
  "comodos": ["cozinha", "sala", "quarto", "banheiro"],
  "intro": [
    {
      "id": 1,
      "name": "WHILE",
      "description": "bla bla"
    },
    {
      "id": 2,
      "name": "IF / ELSE",
      "description": "bla bla"
    },
    {
      "id": 3,
      "name": "LOOP (FOR)",
      "description": "bla bla"
    },
    {
      "id": 4,
      "name": "SWITCH CASE",
      "description": "bla bla"
    }
  ],
  "pergunta-cozinha": [
    {
      "description": "Joãozinho decidiu fazer uma omelete, mas sabe que dos 10 ovos que estão na geladeira, 4 estão podres. Ele precisa de 3 ovos para fazer sua omelete e não tem certeza de quais são os 4 ovos podres. No recipiente, ele só consegue retirar um ovo por vez, então decide quebrar um a um, até obter os 3 ovos em bom estado. Após quebrar 7 ovos, Joãozinho consegue os 3 ovos pra sua omelete, encerrando sua busca. Considerando o context e a solução usada para encontrar os 3 ovos, qual elemento de programação podemos identificar?",
      "introId": 3,
      "option": [
        {
          "text": "LOOP (FOR)",
          "isCorrect": true
        },
        {
          "text": "IF / ELSE",
          "isCorrect": false
        }
      ]
    }
  ],
  "pergunta-sala": [
    {
      "description": "Joãozinho configurou em seu serviço de TV para não permitir perfis menores de 18 anos conseguir visualizar filmes de terror e de conteúdo adulto. Quando sua filha de 9 anos tentar acessar a TV, e escolher um filme dos gêneros bloqueado s pelo pai, ela não conseguirá visualizar, para qualquer outro gênero poderá assistir o filme. Usando o conceito apresentado qual elemento da programação pode ser escolhido?",
      "introId": 4,
      "option": [
        {
          "text": "IF / ELSE",
          "isCorrect": false
        },
        {
          "text": "SWITCH CASE",
          "isCorrect": true
        }
      ]
    }
  ],
  "pergunta-quarto": [
    {
      "description": "Hoje é quarta-feira e Joãozinho tem uma prova de matematica amanha. Seu amigo o chamou pra eles passarem a tarde jogando futebol, mas Joãozinho ainda não estudou pra prova. Se ele atender o convite do amigo, existe um grande risco dele ficar reprovado. Considerando a situação em que Joãozinho se encontra, qual o elemento da programação pode representar o seu dilema?",
      "introId": 2,
      "opções": [
        {
          "text": "WHILE",
          "isCorrect": false
        },
        {
          "text": "IF / ELSE",
          "isCorrect": true
        }
      ]
    }
  ],
  "pergunta-banheiro": [
    {
      "description": "Joãozinho criou um mecanismo em seu chuveiro para economizar água e adotar um consumo mais consciente. Quando ele abre o chuveiro, um timer de 10 minutos começa a contar, e quando os 10 minutos se expiram, a água é desligada. Enquanto o tempo de 10 minutos não for atingido, o chuveiro permanece ligado. Considerando o caso descrito, qual elemento da programação pode ser identificado?",
      "introId": 1,
      "opções": [
        {
          "text": "SWITCH CASE",
          "isCorrect": false
        },
        {
          "text": "WHILE",
          "isCorrect": true
        }
      ]
    }
  ]
}
